zhanzr/TC234_Tasking_62_Demo/SoftwarePlatform/illd_tc23x/src/ifx/TC23x/Multican/Can/IfxMultican_Can.h
/** \brief Clear the RX pending flag of a message object
 * \param msgObj pointer to the CAN message object handle
 * \return None
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_INLINE void IfxMultican_Can_MsgObj_clearRxPending(IfxMultican_Can_MsgObj *msgObj);

/** \brief Clear the TX pending flag of a message object
 * \param msgObj pointer to the CAN message object handle
 * \return None
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_INLINE void IfxMultican_Can_MsgObj_clearTxPending(IfxMultican_Can_MsgObj *msgObj);

/** \brief Reset the message object\n
 * Append the message object to the end of idle list and reset message object registers
 * \param msgObj pointer to the CAN message object handle
 * \return None
 */
IFX_INLINE void IfxMultican_Can_MsgObj_deinit(IfxMultican_Can_MsgObj *msgObj);

/** \brief Get message object ID which has TX/RX pending flag from a message object group
 * \param msgObj pointer to the CAN message object handle
 * \param msgObjGroup Message object group
 * \return Message Object Id
 */
IFX_INLINE IfxMultican_MsgObjId IfxMultican_Can_MsgObj_getPendingId(IfxMultican_Can_MsgObj *msgObj, IfxMultican_MsgObjGroup msgObjGroup);

/** \brief Get the message object status
 * \param msgObj pointer to the CAN message object handle
 * \return \ref IfxMultican_MsgObjStat bitfield
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_INLINE IfxMultican_MsgObjStat IfxMultican_Can_MsgObj_getStatus(IfxMultican_Can_MsgObj *msgObj);

/** \brief Read a received CAN message
 * \param msgObj pointer to the CAN message object handle
 * \param msg This parameter is filled in by the function with the received message. Also when reading is not successful
 * \param data Pointer to data (in words)
 * \return IfxMultican_Status_newData: if the operation was successful\n
 * IfxMultican_Status_newDataButMessageLost: if the one message lost and last new data is retrieved successfully\n
 * IfxMultican_Status_messageLost: if the message lost and new data is not yet ready\n
 * IfxMultican_Status_receiveEmpty: if no message is been received
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_INLINE IfxMultican_Status IfxMultican_Can_MsgObj_readLongFrame(IfxMultican_Can_MsgObj *msgObj, IfxMultican_Message *msg, uint32 *data);

/** \brief Read a received CAN message
 * \param msgObj pointer to the CAN message object handle
 * \param msg This parameter is filled in by the function with the received message. Also when reading is not successful
 * \param data Pointer to data (in words)
 * \return IfxMultican_Status_ok: if the operation was successful
 * IfxMultican_Status_notSentBusy: if the operation was unsuccessful due to hardware is busy
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_INLINE IfxMultican_Status IfxMultican_Can_MsgObj_sendLongFrame(IfxMultican_Can_MsgObj *msgObj, IfxMultican_Message *msg, uint32 *data);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Get the actual message object configuration
 * \param msgObj pointer to the CAN message object handle
 * \param config Pointer to the RAM buffer. Filled by this function
 * \return None
 */
IFX_EXTERN void IfxMultican_Can_MsgObj_getConfig(IfxMultican_Can_MsgObj *msgObj, IfxMultican_Can_MsgObjConfig *config);

/** \brief Initialize the message object
 * \param msgObj pointer to the CAN message object handle
 * \param config pointer to the CAN message object configuration
 * \return Status
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_EXTERN IfxMultican_Status IfxMultican_Can_MsgObj_init(IfxMultican_Can_MsgObj *msgObj, const IfxMultican_Can_MsgObjConfig *config);

/** \brief Initialise message config with default values and the given parameters
 * \param config pointer to the CAN message object configuration
 * \param node pointer to the CAN node handle to which the message object should be assigned
 * \return None
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_EXTERN void IfxMultican_Can_MsgObj_initConfig(IfxMultican_Can_MsgObjConfig *config, IfxMultican_Can_Node *node);

/** \brief Returns the RX pending flag of a message object.
 * \param msgObj pointer to the CAN message object handle
 * \return TRUE of the RX pending flag of a message object is set
 */
IFX_EXTERN boolean IfxMultican_Can_MsgObj_isRxPending(IfxMultican_Can_MsgObj *msgObj);

/** \brief Returns the TX Request flag of a message object.
 * \param msgObj pointer to the CAN message object handle
 * \return TRUE of the TX Request flag of a message object is set
 */
IFX_EXTERN boolean IfxMultican_Can_MsgObj_isTransmitRequested(IfxMultican_Can_MsgObj *msgObj);

/** \brief Returns the TX pending flag of a message object.
 * \param msgObj pointer to the CAN message object handle
 * \return TRUE of the TX pending flag of a message object is set
 */
IFX_EXTERN boolean IfxMultican_Can_MsgObj_isTxPending(IfxMultican_Can_MsgObj *msgObj);

/** \brief Read a received CAN message
 * \param msgObj pointer to the CAN message object handle
 * \param msg This parameter is filled in by the function with the received message. Also when reading is not successful
 * \return IfxMultican_Status_newData: if the operation was successful\n
 * IfxMultican_Status_newDataButMessageLost: if the one message lost and last new data is retrieved successfully\n
 * IfxMultican_Status_messageLost: if the message lost and new data is not yet ready\n
 * IfxMultican_Status_receiveEmpty: if no message is been received
 *
 * A coding example can be found in \ref IfxLld_Multican_Can_Usage
 *
 */
IFX_EXTERN IfxMultican_Status IfxMultican_Can_MsgObj_readMessage(IfxMultican_Can_MsgObj *msgObj, IfxMultican_Message *msg);

